# 1149
'''
3
26 40 83
49 60 57
13 89 99
'''

n = int(input())
p = [[26, 40, 83], [49, 60, 57], [13, 89, 99]] # 집을 색칠하기 위한 비용
for _ in range(n):
    p.append(list(map(int, input().split())))

print(p)
# [[26, 40, 83], [49, 60, 57], [13, 89, 99]]
 [[26, 40, 83], [89, 86, 83], [96, 172, 185]]
# [[26, 40, 83], [89, 86, 83], [96, 172, 185]]
# 2번째 집까지 색칠하는 경우에서 최소비용을 찾는 것
# 3번째 집까지 색칠하는 경우에서 최소비용을 찾는 것

for i in range(1, len(p)):
    p[i][0] = min(p[i - 1][1], p[i - 1][2]) + p[i][0]
    p[i][1] = min(p[i - 1][0], p[i - 1][2]) + p[i][1]
    p[i][2] = min(p[i - 1][0], p[i - 1][1]) + p[i][2]
